app/controllers/books_controller.rb

  def bulk_delete_books
    respond_to do |format|
      @books = Book.where(id: params[:book_ids])
      @books.delete_all
---
SELECT "books".* FROM "books" WHERE "books"."id" = ?  [["id", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]